program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.2.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<fp16, [1, 1500, 512]> encoder_output_embeds, tensor<int32, [1, ?]> input_ids) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>>>((("DefaultShapes", {{"input_ids", [1, 1]}}), ("EnumeratedShapes", {{"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_100_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 100]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_101_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 101]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_102_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 102]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_103_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 103]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_104_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 104]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_105_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 105]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_106_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 106]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_107_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 107]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_108_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 108]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_109_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 109]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_10_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 10]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_110_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 110]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_111_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 111]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_112_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 112]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_113_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 113]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_114_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 114]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_115_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 115]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_116_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 116]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_117_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 117]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_118_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 118]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_119_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 119]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_11_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 11]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_120_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 120]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_121_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 121]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_122_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 122]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_123_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 123]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_124_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 124]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_125_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 125]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_126_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 126]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_127_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 127]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_128_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 128]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_12_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 12]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_13_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 13]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_14_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 14]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_15_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 15]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_16_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 16]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_17_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 17]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_18_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 18]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_19_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 19]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_1_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 1]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_20_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 20]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_21_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 21]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_22_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 22]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_23_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 23]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_24_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 24]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_25_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 25]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_26_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 26]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_27_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 27]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_28_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 28]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_29_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 29]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_2_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 2]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_30_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 30]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_31_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 31]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_32_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 32]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_33_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 33]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_34_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 34]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_35_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 35]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_36_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 36]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_37_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 37]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_38_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 38]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_39_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 39]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_3_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 3]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_40_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 40]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_41_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 41]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_42_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 42]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_43_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 43]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_44_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 44]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_45_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 45]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_46_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 46]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_47_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 47]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_48_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 48]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_49_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 49]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_4_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 4]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_50_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 50]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_51_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 51]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_52_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 52]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_53_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 53]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_54_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 54]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_55_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 55]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_56_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 56]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_57_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 57]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_58_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 58]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_59_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 59]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_5_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 5]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_60_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 60]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_61_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 61]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_62_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 62]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_63_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 63]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_64_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 64]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_65_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 65]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_66_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 66]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_67_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 67]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_68_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 68]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_69_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 69]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_6_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 6]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_70_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 70]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_71_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 71]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_72_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 72]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_73_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 73]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_74_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 74]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_75_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 75]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_76_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 76]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_77_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 77]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_78_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 78]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_79_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 79]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_7_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 7]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_80_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 80]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_81_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 81]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_82_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 82]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_83_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 83]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_84_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 84]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_85_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 85]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_86_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 86]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_87_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 87]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_88_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 88]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_89_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 89]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_8_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 8]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_90_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 90]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_91_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 91]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_92_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 92]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_93_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 93]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_94_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 94]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_95_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 95]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_96_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 96]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_97_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 97]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_98_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 98]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_99_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 99]}}}, {"encoder_output_embeds_1_1_1_1500_512_input_ids_1_1_1_1_9_", {{"encoder_output_embeds", [1, 1500, 512]}, {"input_ids", [1, 9]}}}})))] {
            tensor<int32, []> var_23_batch_dims_0 = const()[name = tensor<string, []>("op_23_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> var_23_validate_indices_0 = const()[name = tensor<string, []>("op_23_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [51865, 512]> token_embedding_weight_to_fp16 = const()[name = tensor<string, []>("token_embedding_weight_to_fp16"), val = tensor<fp16, [51865, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, []> greater_equal_0_y_0 = const()[name = tensor<string, []>("greater_equal_0_y_0"), val = tensor<int32, []>(0)];
            tensor<bool, [1, ?]> greater_equal_0 = greater_equal(x = input_ids, y = greater_equal_0_y_0)[name = tensor<string, []>("greater_equal_0")];
            tensor<int32, []> slice_by_index_24 = const()[name = tensor<string, []>("slice_by_index_24"), val = tensor<int32, []>(51865)];
            tensor<int32, [1, ?]> add_0 = add(x = input_ids, y = slice_by_index_24)[name = tensor<string, []>("add_0")];
            tensor<int32, [1, ?]> select_0 = select(a = input_ids, b = add_0, cond = greater_equal_0)[name = tensor<string, []>("select_0")];
            tensor<int32, []> var_23_cast_fp16_axis_0 = const()[name = tensor<string, []>("op_23_cast_fp16_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, ?, 512]> var_23_cast_fp16 = gather(axis = var_23_cast_fp16_axis_0, batch_dims = var_23_batch_dims_0, indices = select_0, validate_indices = var_23_validate_indices_0, x = token_embedding_weight_to_fp16)[name = tensor<string, []>("op_23_cast_fp16")];
            tensor<int32, [2]> var_25_shape = shape(x = input_ids)[name = tensor<string, []>("op_25_shape")];
            tensor<int32, []> gather_0_axis_0 = const()[name = tensor<string, []>("gather_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_0_batch_dims_0 = const()[name = tensor<string, []>("gather_0_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_0_validate_indices_0 = const()[name = tensor<string, []>("gather_0_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_25_shape_to_uint16_dtype_0 = const()[name = tensor<string, []>("op_25_shape_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, []> gather_0_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_0_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<uint16, [2]> var_25_shape_to_uint16 = cast(dtype = var_25_shape_to_uint16_dtype_0, x = var_25_shape)[name = tensor<string, []>("cast_64")];
            tensor<uint16, []> gather_0_cast_uint16 = gather(axis = gather_0_axis_0, batch_dims = gather_0_batch_dims_0, indices = gather_0_indices_0_to_uint16, validate_indices = gather_0_validate_indices_0, x = var_25_shape_to_uint16)[name = tensor<string, []>("gather_0_cast_uint16")];
            tensor<string, []> gather_0_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_0_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> concat_0_values1_0 = const()[name = tensor<string, []>("concat_0_values1_0"), val = tensor<int32, []>(512)];
            tensor<int32, []> concat_0_axis_0 = const()[name = tensor<string, []>("concat_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_0_interleave_0 = const()[name = tensor<string, []>("concat_0_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> gather_0_cast_uint16_to_int32 = cast(dtype = gather_0_cast_uint16_to_int32_dtype_0, x = gather_0_cast_uint16)[name = tensor<string, []>("cast_63")];
            tensor<int32, [2]> concat_0 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = (gather_0_cast_uint16_to_int32, concat_0_values1_0))[name = tensor<string, []>("concat_0")];
            tensor<int32, [2]> var_31_begin_0 = const()[name = tensor<string, []>("op_31_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> var_31_end_mask_0 = const()[name = tensor<string, []>("op_31_end_mask_0"), val = tensor<bool, [2]>([false, true])];
            tensor<fp16, [448, 512]> positional_embedding_to_fp16 = const()[name = tensor<string, []>("positional_embedding_to_fp16"), val = tensor<fp16, [448, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53109888)))];
            tensor<fp16, [?, 512]> var_31_cast_fp16 = slice_by_index(begin = var_31_begin_0, end = concat_0, end_mask = var_31_end_mask_0, x = positional_embedding_to_fp16)[name = tensor<string, []>("op_31_cast_fp16")];
            tensor<fp16, [1, ?, 512]> input_1_cast_fp16 = add(x = var_23_cast_fp16, y = var_31_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, []> var_44 = const()[name = tensor<string, []>("op_44"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> input_3_axes_0 = const()[name = tensor<string, []>("input_3_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [512]> blocks_0_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_weight_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53568704)))];
            tensor<fp16, [512]> blocks_0_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53569792)))];
            tensor<fp16, []> var_46_to_fp16 = const()[name = tensor<string, []>("op_46_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 512]> input_3_cast_fp16 = layer_norm(axes = input_3_axes_0, beta = blocks_0_attn_ln_bias_to_fp16, epsilon = var_46_to_fp16, gamma = blocks_0_attn_ln_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_attn_query_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_query_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53570880)))];
            tensor<fp16, [512]> blocks_0_attn_query_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_query_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54095232)))];
            tensor<fp16, [1, ?, 512]> linear_0_cast_fp16 = linear(bias = blocks_0_attn_query_bias_to_fp16, weight = blocks_0_attn_query_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_key_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54096320)))];
            tensor<fp16, [512]> linear_1_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_1_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54620672)))];
            tensor<fp16, [1, ?, 512]> linear_1_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = blocks_0_attn_key_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54621760)))];
            tensor<fp16, [512]> blocks_0_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55146112)))];
            tensor<fp16, [1, ?, 512]> linear_2_cast_fp16 = linear(bias = blocks_0_attn_value_bias_to_fp16, weight = blocks_0_attn_value_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [3]> var_70_shape_cast_fp16 = shape(x = linear_0_cast_fp16)[name = tensor<string, []>("op_70_shape_cast_fp16")];
            tensor<int32, []> gather_2_axis_0 = const()[name = tensor<string, []>("gather_2_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_2_batch_dims_0 = const()[name = tensor<string, []>("gather_2_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_2_validate_indices_0 = const()[name = tensor<string, []>("gather_2_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_70_shape_cast_fp16_to_uint16_dtype_0 = const()[name = tensor<string, []>("op_70_shape_cast_fp16_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, []> gather_2_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_2_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<uint16, [3]> var_70_shape_cast_fp16_to_uint16 = cast(dtype = var_70_shape_cast_fp16_to_uint16_dtype_0, x = var_70_shape_cast_fp16)[name = tensor<string, []>("cast_62")];
            tensor<uint16, []> gather_2_cast_uint16 = gather(axis = gather_2_axis_0, batch_dims = gather_2_batch_dims_0, indices = gather_2_indices_0_to_uint16, validate_indices = gather_2_validate_indices_0, x = var_70_shape_cast_fp16_to_uint16)[name = tensor<string, []>("gather_2_cast_uint16")];
            tensor<string, []> gather_2_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_2_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, [4]> concat_1x = const()[name = tensor<string, []>("concat_1x"), val = tensor<int32, [4]>([1, -1, 8, 64])];
            tensor<fp16, [1, ?, 8, 64]> var_80_cast_fp16 = reshape(shape = concat_1x, x = linear_0_cast_fp16)[name = tensor<string, []>("op_80_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1]> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, ?, 8, 64]> q_3_cast_fp16 = mul(x = var_80_cast_fp16, y = const_6_to_fp16)[name = tensor<string, []>("q_3_cast_fp16")];
            tensor<int32, [4]> concat_2x = const()[name = tensor<string, []>("concat_2x"), val = tensor<int32, [4]>([1, -1, 8, 64])];
            tensor<fp16, [1, ?, 8, 64]> var_86_cast_fp16 = reshape(shape = concat_2x, x = linear_1_cast_fp16)[name = tensor<string, []>("op_86_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1]> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, ?, 8, 64]> k_3_cast_fp16 = mul(x = var_86_cast_fp16, y = const_7_to_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<int32, [4]> concat_3x = const()[name = tensor<string, []>("concat_3x"), val = tensor<int32, [4]>([1, -1, 8, 64])];
            tensor<fp16, [1, ?, 8, 64]> var_91_cast_fp16 = reshape(shape = concat_3x, x = linear_2_cast_fp16)[name = tensor<string, []>("op_91_cast_fp16")];
            tensor<int32, [4]> var_92 = const()[name = tensor<string, []>("op_92"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_1_transpose_x_0 = const()[name = tensor<string, []>("qk_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_1_transpose_y_0 = const()[name = tensor<string, []>("qk_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = tensor<string, []>("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = tensor<string, []>("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 8, 64, ?]> transpose_50 = transpose(perm = transpose_50_perm_0, x = k_3_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 8, ?, 64]> transpose_49 = transpose(perm = transpose_49_perm_0, x = q_3_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 8, ?, ?]> qk_1_cast_fp16 = matmul(transpose_x = qk_1_transpose_x_0, transpose_y = qk_1_transpose_y_0, x = transpose_49, y = transpose_50)[name = tensor<string, []>("qk_1_cast_fp16")];
            tensor<int32, []> concat_4_values1_0 = const()[name = tensor<string, []>("concat_4_values1_0"), val = tensor<int32, []>(448)];
            tensor<int32, []> concat_4_axis_0 = const()[name = tensor<string, []>("concat_4_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_4_interleave_0 = const()[name = tensor<string, []>("concat_4_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> gather_2_cast_uint16_to_int32 = cast(dtype = gather_2_cast_uint16_to_int32_dtype_0, x = gather_2_cast_uint16)[name = tensor<string, []>("cast_61")];
            tensor<int32, [2]> concat_4 = concat(axis = concat_4_axis_0, interleave = concat_4_interleave_0, values = (gather_2_cast_uint16_to_int32, concat_4_values1_0))[name = tensor<string, []>("concat_4")];
            tensor<int32, [2]> var_95_begin_0 = const()[name = tensor<string, []>("op_95_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> var_95_end_mask_0 = const()[name = tensor<string, []>("op_95_end_mask_0"), val = tensor<bool, [2]>([false, true])];
            tensor<fp16, [448, 448]> mask_to_fp16 = const()[name = tensor<string, []>("mask_to_fp16"), val = tensor<fp16, [448, 448]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55147200)))];
            tensor<fp16, [?, 448]> var_95_cast_fp16 = slice_by_index(begin = var_95_begin_0, end = concat_4, end_mask = var_95_end_mask_0, x = mask_to_fp16)[name = tensor<string, []>("op_95_cast_fp16")];
            tensor<int32, []> concat_5_values0_0 = const()[name = tensor<string, []>("concat_5_values0_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> concat_5_axis_0 = const()[name = tensor<string, []>("concat_5_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_5_interleave_0 = const()[name = tensor<string, []>("concat_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [2]> concat_5 = concat(axis = concat_5_axis_0, interleave = concat_5_interleave_0, values = (concat_5_values0_0, gather_2_cast_uint16_to_int32))[name = tensor<string, []>("concat_5")];
            tensor<int32, [2]> var_96_begin_0 = const()[name = tensor<string, []>("op_96_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> var_96_end_mask_0 = const()[name = tensor<string, []>("op_96_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [?, ?]> var_96_cast_fp16 = slice_by_index(begin = var_96_begin_0, end = concat_5, end_mask = var_96_end_mask_0, x = var_95_cast_fp16)[name = tensor<string, []>("op_96_cast_fp16")];
            tensor<fp16, [1, 8, ?, ?]> input_5_cast_fp16 = add(x = qk_1_cast_fp16, y = var_96_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 8, ?, ?]> w_1_cast_fp16 = softmax(axis = var_44, x = input_5_cast_fp16)[name = tensor<string, []>("w_1_cast_fp16")];
            tensor<bool, []> var_99_transpose_x_0 = const()[name = tensor<string, []>("op_99_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_99_transpose_y_0 = const()[name = tensor<string, []>("op_99_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, ?, 64]> v_3_cast_fp16 = transpose(perm = var_92, x = var_91_cast_fp16)[name = tensor<string, []>("transpose_120")];
            tensor<fp16, [1, 8, ?, 64]> var_99_cast_fp16 = matmul(transpose_x = var_99_transpose_x_0, transpose_y = var_99_transpose_y_0, x = w_1_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("op_99_cast_fp16")];
            tensor<int32, [4]> var_100 = const()[name = tensor<string, []>("op_100"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_6x = const()[name = tensor<string, []>("concat_6x"), val = tensor<int32, [3]>([1, -1, 512])];
            tensor<fp16, [1, ?, 8, 64]> var_101_cast_fp16 = transpose(perm = var_100, x = var_99_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, ?, 512]> input_7_cast_fp16 = reshape(shape = concat_6x, x = var_101_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55548672)))];
            tensor<fp16, [512]> blocks_0_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56073024)))];
            tensor<fp16, [1, ?, 512]> linear_3_cast_fp16 = linear(bias = blocks_0_attn_out_bias_to_fp16, weight = blocks_0_attn_out_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, ?, 512]> input_9_cast_fp16 = add(x = input_1_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = tensor<string, []>("input_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [512]> blocks_0_cross_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_ln_weight_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56074112)))];
            tensor<fp16, [512]> blocks_0_cross_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_ln_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56075200)))];
            tensor<fp16, [1, ?, 512]> input_11_cast_fp16 = layer_norm(axes = input_11_axes_0, beta = blocks_0_cross_attn_ln_bias_to_fp16, epsilon = var_46_to_fp16, gamma = blocks_0_cross_attn_ln_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_cross_attn_query_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_query_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56076288)))];
            tensor<fp16, [512]> blocks_0_cross_attn_query_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_query_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56600640)))];
            tensor<fp16, [1, ?, 512]> linear_4_cast_fp16 = linear(bias = blocks_0_cross_attn_query_bias_to_fp16, weight = blocks_0_cross_attn_query_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_cross_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_key_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56601728)))];
            tensor<fp16, [1, 1500, 512]> linear_5_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = blocks_0_cross_attn_key_weight_to_fp16, x = encoder_output_embeds)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_cross_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_value_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57126080)))];
            tensor<fp16, [512]> blocks_0_cross_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57650432)))];
            tensor<fp16, [1, 1500, 512]> linear_6_cast_fp16 = linear(bias = blocks_0_cross_attn_value_bias_to_fp16, weight = blocks_0_cross_attn_value_weight_to_fp16, x = encoder_output_embeds)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> concat_7x = const()[name = tensor<string, []>("concat_7x"), val = tensor<int32, [4]>([1, -1, 8, 64])];
            tensor<fp16, [1, ?, 8, 64]> var_136_cast_fp16 = reshape(shape = concat_7x, x = linear_4_cast_fp16)[name = tensor<string, []>("op_136_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1]> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, ?, 8, 64]> q_7_cast_fp16 = mul(x = var_136_cast_fp16, y = const_8_to_fp16)[name = tensor<string, []>("q_7_cast_fp16")];
            tensor<int32, [4]> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, [4]>([1, 1500, 8, 64])];
            tensor<fp16, [1, 1500, 8, 64]> var_142_cast_fp16 = reshape(shape = var_141, x = linear_5_cast_fp16)[name = tensor<string, []>("op_142_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1]> const_9_to_fp16 = const()[name = tensor<string, []>("const_9_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 8, 64]> k_7_cast_fp16 = mul(x = var_142_cast_fp16, y = const_9_to_fp16)[name = tensor<string, []>("k_7_cast_fp16")];
            tensor<int32, [4]> var_146 = const()[name = tensor<string, []>("op_146"), val = tensor<int32, [4]>([1, 1500, 8, 64])];
            tensor<fp16, [1, 1500, 8, 64]> var_147_cast_fp16 = reshape(shape = var_146, x = linear_6_cast_fp16)[name = tensor<string, []>("op_147_cast_fp16")];
            tensor<int32, [4]> var_148 = const()[name = tensor<string, []>("op_148"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> input_13_transpose_x_0 = const()[name = tensor<string, []>("input_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_13_transpose_y_0 = const()[name = tensor<string, []>("input_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = tensor<string, []>("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = tensor<string, []>("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [1, 8, 64, 1500]> transpose_52 = transpose(perm = transpose_52_perm_0, x = k_7_cast_fp16)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [1, 8, ?, 64]> transpose_51 = transpose(perm = transpose_51_perm_0, x = q_7_cast_fp16)[name = tensor<string, []>("transpose_115")];
            tensor<fp16, [1, 8, ?, 1500]> input_13_cast_fp16 = matmul(transpose_x = input_13_transpose_x_0, transpose_y = input_13_transpose_y_0, x = transpose_51, y = transpose_52)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 8, ?, 1500]> w_3_cast_fp16 = softmax(axis = var_44, x = input_13_cast_fp16)[name = tensor<string, []>("w_3_cast_fp16")];
            tensor<bool, []> var_152_transpose_x_0 = const()[name = tensor<string, []>("op_152_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_152_transpose_y_0 = const()[name = tensor<string, []>("op_152_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, 1500, 64]> v_7_cast_fp16 = transpose(perm = var_148, x = var_147_cast_fp16)[name = tensor<string, []>("transpose_116")];
            tensor<fp16, [1, 8, ?, 64]> var_152_cast_fp16 = matmul(transpose_x = var_152_transpose_x_0, transpose_y = var_152_transpose_y_0, x = w_3_cast_fp16, y = v_7_cast_fp16)[name = tensor<string, []>("op_152_cast_fp16")];
            tensor<int32, [4]> var_153 = const()[name = tensor<string, []>("op_153"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_8x = const()[name = tensor<string, []>("concat_8x"), val = tensor<int32, [3]>([1, -1, 512])];
            tensor<fp16, [1, ?, 8, 64]> var_154_cast_fp16 = transpose(perm = var_153, x = var_152_cast_fp16)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [1, ?, 512]> input_15_cast_fp16 = reshape(shape = concat_8x, x = var_154_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_0_cross_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_out_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57651520)))];
            tensor<fp16, [512]> blocks_0_cross_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_cross_attn_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58175872)))];
            tensor<fp16, [1, ?, 512]> linear_7_cast_fp16 = linear(bias = blocks_0_cross_attn_out_bias_to_fp16, weight = blocks_0_cross_attn_out_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [1, ?, 512]> input_17_cast_fp16 = add(x = input_9_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [1]> input_19_axes_0 = const()[name = tensor<string, []>("input_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [512]> blocks_0_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_weight_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58176960)))];
            tensor<fp16, [512]> blocks_0_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58178048)))];
            tensor<fp16, [1, ?, 512]> input_19_cast_fp16 = layer_norm(axes = input_19_axes_0, beta = blocks_0_mlp_ln_bias_to_fp16, epsilon = var_46_to_fp16, gamma = blocks_0_mlp_ln_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [2048, 512]> blocks_0_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_weight_to_fp16"), val = tensor<fp16, [2048, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58179136)))];
            tensor<fp16, [2048]> blocks_0_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_bias_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60276352)))];
            tensor<fp16, [1, ?, 2048]> linear_8_cast_fp16 = linear(bias = blocks_0_mlp_0_bias_to_fp16, weight = blocks_0_mlp_0_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<string, []> input_23_mode_0 = const()[name = tensor<string, []>("input_23_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, ?, 2048]> input_23_cast_fp16 = gelu(mode = input_23_mode_0, x = linear_8_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [512, 2048]> blocks_0_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_weight_to_fp16"), val = tensor<fp16, [512, 2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60280512)))];
            tensor<fp16, [512]> blocks_0_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62377728)))];
            tensor<fp16, [1, ?, 512]> linear_9_cast_fp16 = linear(bias = blocks_0_mlp_2_bias_to_fp16, weight = blocks_0_mlp_2_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, ?, 512]> input_25_cast_fp16 = add(x = input_17_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<int32, []> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> input_27_axes_0 = const()[name = tensor<string, []>("input_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [512]> blocks_1_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_weight_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62378816)))];
            tensor<fp16, [512]> blocks_1_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62379904)))];
            tensor<fp16, []> var_188_to_fp16 = const()[name = tensor<string, []>("op_188_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 512]> input_27_cast_fp16 = layer_norm(axes = input_27_axes_0, beta = blocks_1_attn_ln_bias_to_fp16, epsilon = var_188_to_fp16, gamma = blocks_1_attn_ln_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_1_attn_query_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_query_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62380992)))];
            tensor<fp16, [512]> blocks_1_attn_query_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_query_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62905344)))];
            tensor<fp16, [1, ?, 512]> linear_10_cast_fp16 = linear(bias = blocks_1_attn_query_bias_to_fp16, weight = blocks_1_attn_query_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_1_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_key_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62906432)))];
            tensor<fp16, [1, ?, 512]> linear_11_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = blocks_1_attn_key_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [512, 512]> blocks_1_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63430784)))];
            tensor<fp16, [512]> blocks_1_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63955136)))];
